package less8StreamsLambdas;

//1
//Дан список целых чисел. Найти средне всех нечетных чисел, делящихся на 5.

//   2
//Дан список строк. Найти кол-во уникальных строк длинной более 8 символов.

//  3
//  Дана Map <String, Integer>. Найти сумму всех значений, длинна ключей которых меньше 7 символов.

//  4
// Дан список целых чисел. Вывести строку представляющую собой конкатенацию строковых представлений эих чисел.
// Пример: список {5,2,4,2,1} Результатирующая строка: "52421"

//5
// Дан класс Person с полями firstName, lastName, age.
//Вывести полное имя самого старшего человека, у которого длина этого имени не привышает 15 символов

public class StreamsLambdas {

}
