package less14Threads;

import java.util.*;

import static less14Threads.ProducerConsumer.FirstExample.list;

// Написать программу бесконечно считывающую пользовательские числа с консоли.
// Эти числа представляют собой количество секунд.
// При каждом вводе числа должна создаваться задача которая засыпает на введенное кол-во секунд
// а затем выводит "я спал N сек."
//все задачи выполняться должны в одном и том же потоке в порядке ввода. те в программе есть 2 потока:
// главный и поток для выполнения всех задач по очереди. при вводе 1 программа завершает работу

public class Task4 {

    public static void main(String[] args) {
    }
}